<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#pandas-的数据结构介绍" data-toc-modified-id="pandas-的数据结构介绍-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>pandas 的数据结构介绍</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#DataFrame" data-toc-modified-id="DataFrame-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>DataFrame</a></span></li><li><span><a href="#索引对象" data-toc-modified-id="索引对象-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>索引对象</a></span></li></ul></li><li><span><a href="#基本功能" data-toc-modified-id="基本功能-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>基本功能</a></span><ul class="toc-item"><li><span><a href="#重新索引" data-toc-modified-id="重新索引-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>重新索引</a></span></li><li><span><a href="#丢弃指定轴上的项" data-toc-modified-id="丢弃指定轴上的项-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>丢弃指定轴上的项</a></span></li><li><span><a href="#索引、选取和过滤" data-toc-modified-id="索引、选取和过滤-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>索引、选取和过滤</a></span></li><li><span><a href="#算术运算和数据对齐" data-toc-modified-id="算术运算和数据对齐-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>算术运算和数据对齐</a></span><ul class="toc-item"><li><span><a href="#在算术方法中填充值" data-toc-modified-id="在算术方法中填充值-2.4.1"><span class="toc-item-num">2.4.1&nbsp;&nbsp;</span>在算术方法中填充值</a></span></li></ul></li><li><span><a href="#DataFrame-和-Series-之间的运算" data-toc-modified-id="DataFrame-和-Series-之间的运算-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>DataFrame 和 Series 之间的运算</a></span></li><li><span><a href="#函数应用和映射" data-toc-modified-id="函数应用和映射-2.6"><span class="toc-item-num">2.6&nbsp;&nbsp;</span>函数应用和映射</a></span></li><li><span><a href="#排序和排名" data-toc-modified-id="排序和排名-2.7"><span class="toc-item-num">2.7&nbsp;&nbsp;</span>排序和排名</a></span></li><li><span><a href="#带有重复值的轴索引" data-toc-modified-id="带有重复值的轴索引-2.8"><span class="toc-item-num">2.8&nbsp;&nbsp;</span>带有重复值的轴索引</a></span></li></ul></li><li><span><a href="#汇总和计算描述统计" data-toc-modified-id="汇总和计算描述统计-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>汇总和计算描述统计</a></span><ul class="toc-item"><li><span><a href="#相关系数与协方差" data-toc-modified-id="相关系数与协方差-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>相关系数与协方差</a></span></li><li><span><a href="#唯一值、值计数以及成员资格" data-toc-modified-id="唯一值、值计数以及成员资格-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>唯一值、值计数以及成员资格</a></span></li></ul></li><li><span><a href="#处理缺失数据" data-toc-modified-id="处理缺失数据-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>处理缺失数据</a></span><ul class="toc-item"><li><span><a href="#滤除缺失数据" data-toc-modified-id="滤除缺失数据-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>滤除缺失数据</a></span></li><li><span><a href="#填充缺失数据" data-toc-modified-id="填充缺失数据-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>填充缺失数据</a></span></li></ul></li><li><span><a href="#层次化索引" data-toc-modified-id="层次化索引-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>层次化索引</a></span><ul class="toc-item"><li><span><a href="#重排分级顺序" data-toc-modified-id="重排分级顺序-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>重排分级顺序</a></span></li><li><span><a href="#根据级别汇总统计" data-toc-modified-id="根据级别汇总统计-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>根据级别汇总统计</a></span></li><li><span><a href="#使用DataFrame的列" data-toc-modified-id="使用DataFrame的列-5.3"><span class="toc-item-num">5.3&nbsp;&nbsp;</span>使用DataFrame的列</a></span></li></ul></li><li><span><a href="#其他有关pandas的话题" data-toc-modified-id="其他有关pandas的话题-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>其他有关pandas的话题</a></span><ul class="toc-item"><li><span><a href="#面板数据" data-toc-modified-id="面板数据-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>面板数据</a></span></li></ul></li></ul></div>

In [1]:
%matplotlib inline
#使图片内嵌交互环境显示
import numpy as np
from pandas import Series,DataFrame
import pandas as pd
import matplotlib.pyplot as plt

## pandas 的数据结构介绍

### Series

In [2]:
# Series 类似一维数组
obj = Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
# Series 的字符串表现形式：索引在左边（如果没有指定，则自动匹配），值在右边
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
# 手动配置索引
obj2 = Series([4,7,-5,3],index = ['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
# 与Numpy相比，可以直接通过索引选取Series的值
obj2['a']

-5

In [8]:
obj2['d'] = 6
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [9]:
# 在Numpy运算中，索引和值会保留链接
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [10]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [11]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [12]:
# 可以将Series看成有序字典（使用字典函数）
'b' in obj2

True

In [13]:
'e' in obj2

False

In [14]:
# 可以直接通过字典创建Series
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [15]:
# 传入字典，定义索引
states = ['California','Ohio','Oregon','Texas']
obj4 = Series(sdata,index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [16]:
# 上述：'California'所对应的sdata值找不到，其结果就是NaN（即非数字not a number，在pandas中，它用于表示缺失或NA值）
# pandas中的 isnull 和 notnull 函数用于检测缺失数据
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [17]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [18]:
# Series 有类似的 实例方法
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
# Series 最重要的是： 它会自动对齐不同索引的数据
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [20]:
# Series对象本身 及其索引都有一个name属性
obj4.name = 'Population'
obj4.index.name = 'States'
obj4

States
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

In [21]:
# Series 的索引可以通过赋值的方式就地修改
obj.index = ['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

- DataFrame 是一个表格型的数据结构
    - DataFrame即有行索引也有列索引
    - DataFrame中面向行和面向咧的操作基本上是平衡的
    - 虽然DataFrame是以二维结构保存数据的，但可以轻松的将其表示为更高维度的数据

In [22]:
# 创建DataFrame（如果没有索引会自动添加，和Series一样；而且会有序排列）
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
       'year':[2000,2001,2002,2001,2002],
       'pop':[1.5,1.7,3.6,2.4,2.9]}
frame = DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [23]:
# 可以指定列顺序
DataFrame(data,columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [24]:
# 跟Series一样，如果指定列找不到，则会产生NA值
frame2 = DataFrame(data,columns = ['year','state','pop','debt'],index = ['one','two','three','four','five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [25]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [26]:
# 通过字典标记 或属性的方式 ，从DataFrame的“列”获取Series（保留索引，name属性被定义）
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [27]:
frame.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [28]:
# 通过 loc（通过索引名称）、iloc（通过数字）实例方法，从DataFrame的“行”获取Series
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [29]:
# 列可以赋值
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [30]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [31]:
# 将列表或数组赋值给某个列时，其长度必须跟DataFrame的长度相匹配；
# 如果赋值的是一个Series，会精确匹配DataFrame的索引（空值会被填上缺失值）
val = Series([-1.2,-1.5,-1.7],index = ['two','four','five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [32]:
# 为不存在的列赋值，会创建出一个新列
frame2['eastern'] = frame2['state'] == 'Ohio' # 通过索引['eastern']返回的是视图，而非副本（通过Series的copy方法即可显示的复制）
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [33]:
# 另一种常见的数据形式是嵌套字典（也就是字典的字典）
# 创建DataFrame时，外层字典的键作为列，内层字典的键作为行
# 内层字典的键会被合并、排序行程最终的索引
pop = {'Nevada':{2001 : 2.4, 2002 : 2.9},
      'Ohio':{2000 : 1.5,2001 : 1.7,2002 : 3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [34]:
# 可以对DataFrame进行转置
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [35]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [36]:
# 可以显示的指定索引
DataFrame(pop,index = pd.Series([2001,2002,2003]))

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [37]:
# 内层可以使Series字典，同样的用法
pdata = {'Ohio':frame3['Ohio'][:-1],
        'Nevada':frame3['Nevada'][:2]}
DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

<img src = 'pic\可以输入给DataFrame构造器的数据.jpg'>

In [38]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [39]:
# values 属性会以ndarray的形式返回DataFrame中的数据
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [40]:
# 如果各列类型不同，则值数组的数据类型会选用能兼容所有列的数据类型
frame2.values

array([[2000, 'Ohio', 1.5, nan, True],
       [2001, 'Ohio', 1.7, -1.2, True],
       [2002, 'Ohio', 3.6, nan, True],
       [2001, 'Nevada', 2.4, -1.5, False],
       [2002, 'Nevada', 2.9, -1.7, False]], dtype=object)

### 索引对象

In [41]:
obj = Series(range(3),index = ['a','b','c'])
obj

a    0
b    1
c    2
dtype: int64

In [42]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [43]:
index[1:]

Index(['b', 'c'], dtype='object')

In [44]:
# index索引对象是不可修改
# 不可修改性非常重要，因为这样才能使index对象在多个数据结构之间安全共享
index = pd.Index(np.arange(3))
index

Int64Index([0, 1, 2], dtype='int64')

In [45]:
obj2 = Series([1.5,-2.5,0],index = index)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [46]:
obj2.index is index

True

In [47]:
# Index 对象的功能类似集合
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [48]:
'Ohio' in frame3.columns

True

In [49]:
2003 in frame3.index

False

<img src = 'pic\pd-index的方法和属性.png'>

## 基本功能

### 重新索引

In [50]:
obj = Series([4.5,7.2,-5.3,3.6],index = ['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [51]:
# reindex将会根据新索引进行重排
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [52]:
obj.reindex(['a','b','c','d','e'],fill_value = 0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [53]:
# 通过method选项设置插值处理方式
obj3 = Series(['blue','purple','yellow'],index = [0,2,4])
obj3.reindex(np.arange(6),method = 'ffill') # ffill 或 pad 向前填充；bfill 或 backfill 向后填充

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [54]:
# 对于DataFrame，reindex可以修改行、列索引
frame = DataFrame(np.arange(9).reshape((3,3)),index = ['a','c','d'],columns = ['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [55]:
frame2 = frame.reindex(['a','b','c','d','e'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0
e   NaN    NaN         NaN

In [56]:
# 使用columns关键字即可重新索引列
states = ['Texas','Utah','California']
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [57]:
# 可以对行和列同时重新索引(插值只能按行应用，即0轴)
frame.reindex(columns = states).reindex(index = ['a','b','c','d'],method='ffill')

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [58]:
# 利用loc的标签索引功能，重新索引任务可以变得更加简洁

In [59]:
frame.loc[['a','b','c','d'],states]

C:\Users\yuxin\AppData\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

<img src='pic\reindex函数的参数.png'>

### 丢弃指定轴上的项

In [60]:
# drop方法返回的是一个在指定轴上删除了指定值的新对象
obj = Series(np.arange(5),index = ['a','b','c','d','e'])
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [61]:
obj.drop(['d','c'])

a    0
b    1
e    4
dtype: int32

In [62]:
# 对于DataFrame，可以删除任意轴上的索引值
data = DataFrame(np.arange(16).reshape(4,4),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [63]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [64]:
data.drop('two',axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [65]:
data.drop(['two','four'],axis = 1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### 索引、选取和过滤

In [66]:
obj = Series(np.arange(4.),index=['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [67]:
obj['b']

1.0

In [68]:
obj[1]

1.0

In [69]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [70]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [71]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [72]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [73]:
# 利用标签的切片运算（末端是包含的）
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [74]:
# 设置值
obj['b':'c'] = 5

In [75]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [76]:
# ----------------------
# 对 DataFrame 进行索引
# ----------------------
data = DataFrame(np.arange(16).reshape(4,4),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [77]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [78]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [79]:
# 通过切片 选取"行"
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [80]:
data[:'Colorado']

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [81]:
# 通过布尔型数组 选取行
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [82]:
# 通过布尔型DataFrame进行索引
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [83]:
data[data<5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [84]:
# 通过dataFrame索引选项选取---先选行，再选列
# LOC适用于索引名，ILOC适用于索引编号，IX适用于两者集合（会报警告）
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [85]:
data.ix[['Colorado','Utah'],[3,0,1]]

C:\Users\yuxin\AppData\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [86]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [87]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [88]:
data.ix[data.three>5,:3]

C:\Users\yuxin\AppData\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

<img src = 'pic\DataFrame的索引选项.png'>

### 算术运算和数据对齐

In [89]:
# pandas有自动对齐功能，在算术运算中很重要
s1 = Series([7.3,-2.5,3.4,1.5],index = ['a','c','d','e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [90]:
s2 = Series([-2.1,3.6,-1.5,4,3.1],index = ['a','c','e','f','g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [91]:
s1 + s2 # 自动在“不重叠”位置引入 NA 值

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [92]:
df1 = DataFrame(np.arange(9.).reshape(3,3),columns = list('bcd'),index = ['Ohio','Texas','Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [93]:
df2 = DataFrame(np.arange(12.).reshape(4,3),columns = list('bde'),index = ['Utah','Ohio','Texas','Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [94]:
df1 + df2 # 对于DataFrame，对齐操作会同时发生在行和列上

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### 在算术方法中填充值

In [95]:
df1 = DataFrame(np.arange(12.).reshape((3,4)),columns = list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4,5)),columns = list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [96]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [97]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [98]:
# 使用df 的add方法，可以填充缺失值
df1.add(df2,fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [99]:
# 与此类似，在对Series和DataFrame重新索引时，也可以指定一个填充值
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

<img src='pic\dataFrame灵活的算术方法.png' width = 200>

### DataFrame 和 Series 之间的运算

In [100]:
# 先一个启发性的例子：计算一个二维数组与某行之间的差
# 这个机制叫做：广播
arr = np.arange(12.).reshape(3,4)
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [101]:
arr[0]

array([0., 1., 2., 3.])

In [102]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [103]:
frame = DataFrame(np.arange(12.).reshape(4,3),columns = list('bde'),index = ['Utah','Ohio','Texas','Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [104]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [105]:
# DataFrame 和 Series 之间的算术运算会将Series的索引匹配到DataFrame的列
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [106]:
# 如果索引不重叠，则会形成并集
series2 = Series(np.arange(3),index = ['b','e','f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [107]:
# 如果希望实现匹配行，并在列上广播，则必须用算术运算方法
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [108]:
frame.sub(series3,axis = 0) # 穿入的轴号就是希望匹配的轴，在本例中，匹配的是行索引并进行广播

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### 函数应用和映射

In [109]:
# Numpy的ufuncs（元素级数组方法）也可用于操作pandas对象：
frame = DataFrame(np.random.randn(4,3),columns = list('bde'),index = ['Utah','Ohio','Texas','Oregon'])
frame

               b         d         e
Utah   -0.688370 -0.037920  0.768834
Ohio   -0.252404  0.081158  0.773291
Texas   0.168227 -0.400871 -0.272320
Oregon -0.244468  1.576938  1.576586

In [110]:
np.abs(frame)

               b         d         e
Utah    0.688370  0.037920  0.768834
Ohio    0.252404  0.081158  0.773291
Texas   0.168227  0.400871  0.272320
Oregon  0.244468  1.576938  1.576586

In [111]:
# 另一个常用的操作是：DataFrame的apply方法：将函数应用到由各行或列所形成的一维数组上。
f = lambda x: x.max() - x.min()
frame.apply(f)

b    0.856597
d    1.977809
e    1.848906
dtype: float64

In [112]:
frame.apply(f,axis = 1)

Utah      1.457204
Ohio      1.025694
Texas     0.569098
Oregon    1.821405
dtype: float64

In [113]:
# 除标量值外，传递给apply的函数还可以返回由多个值组成的Series
def f(x):
    return Series([x.min(),x.max()],index = ['min','max'])
frame.apply(f)

            b         d         e
min -0.688370 -0.400871 -0.272320
max  0.168227  1.576938  1.576586

In [114]:
# 元素级的PYTHON函数也是可用的(使用applymap)
format = lambda x: '%.3f' % x
frame.applymap(format)

             b       d       e
Utah    -0.688  -0.038   0.769
Ohio    -0.252   0.081   0.773
Texas    0.168  -0.401  -0.272
Oregon  -0.244   1.577   1.577

In [115]:
# 对于Series不用applymap，而是map
frame['e'].map(format)

Utah       0.769
Ohio       0.773
Texas     -0.272
Oregon     1.577
Name: e, dtype: object

### 排序和排名

In [116]:
# 对行或列索引进行排序
obj = Series(range(4),index=['d','a','b','c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [117]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [118]:
frame = DataFrame(np.arange(8).reshape(2,4),index = ['three','one'],columns = ['d','a','b','c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [119]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [120]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [121]:
# 也可以降序排列
frame.sort_index(axis = 1,ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [122]:
# 按值进行排序
obj = Series([4,7,-3,2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [123]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [124]:
# 缺失值会放到Series的末尾
obj = Series([4,np.nan,7,np.nan,-3,2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [125]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [126]:
# 在DataFrame上，根据一个或多个列中的值进行排序
frame = DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [127]:
frame.sort_values(by = 'b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [128]:
frame.sort_values(by = ['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [129]:
# 排名 与排序关系密切，取得一个排名值（有各种形式处理平级关系的方式）
obj = Series([7,-5,7,4,2,0,4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [130]:
obj.rank() # 默认破坏平衡方式：为各组分配一个平均排名

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [131]:
obj.rank(method = 'first') # 默认破坏平衡方式：出现的先后顺序

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [132]:
# 按降序进行排序
obj.rank(ascending = False,method = 'max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [133]:
# 在DataFrame中使用排名
frame = DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [134]:
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [135]:
frame.rank(axis = 1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

<img src = 'pic\破坏评级关系的method选项.png'>

### 带有重复值的轴索引

In [136]:
# 虽然许多pandas函数都要求标签唯一，但这并不是强制性的。
obj = Series(range(5),index = ['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [137]:
# 通过is_unique属性判断是否唯一
obj.index.is_unique

False

In [138]:
obj['a']

a    0
a    1
dtype: int64

In [139]:
obj['c']

4

In [140]:
# 对于DataFrame的index索引，同样适用

## 汇总和计算描述统计

In [141]:
# 这里的方法，都是基于没有缺失数据的假设而构建的
df = DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index = list('abcd'),columns = ['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [142]:
# sum方法(默认按列，设置axis=1则按行求和)
df.sum()

one    9.25
two   -5.80
dtype: float64

In [143]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [144]:
# NA值会被自动排除，除非整个都是NA。通过skipna选项可以禁用该功能
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

<img src='pic\约简方法的选项.png' width=400>

In [145]:
# 间接统计
df.idxmax()

one    b
two    d
dtype: object

In [146]:
# 累计型统计：
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [147]:
# 一次性产生多个汇总统计
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [148]:
# 非数值型：一次性产生多个汇总统计
obj = Series(list('aabc')*4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

<img src='pic\描述和汇总统计.png' width = 400>

### 相关系数与协方差

In [149]:
import tushare as ts

In [150]:
# 贵州茅台600519；青岛啤酒600600；重庆啤酒600132；老白干酒600559
# ts.get_k_data('600848',start='2015-01-05',end='2015-01-09')
data_dic = {'600519':'贵州茅台','600600':'青岛啤酒','600132':'重庆啤酒','600559':'老白干酒'}
all_data = {}
for ticker in data_dic.keys():
    ts_data = ts.get_k_data(ticker,start = '2015-01-01',end = '2017-12-31')
    ts_data.set_index('date',inplace = True) # inplace表示在原数据上修改，默认情况下设置成索引的列，将从内容列中删除 
    all_data[ticker] = ts_data
price = DataFrame({tic:data['close'] for tic,data in all_data.items()})
price.rename(columns=data_dic,inplace = True)
volume = DataFrame({tic:data['volume'] for tic,data in all_data.items()})
volume.rename(columns=data_dic,inplace = True)

In [151]:
returns = price.pct_change() #返回百分比变化
returns.tail() # 最后几项

                贵州茅台      青岛啤酒      重庆啤酒      老白干酒
2017-12-25  0.007614  0.051294  0.001926 -0.039154
2017-12-26 -0.010622  0.005399 -0.006210  0.011589
2017-12-27 -0.024427 -0.029019 -0.028416 -0.011826
2017-12-28  0.082070 -0.001497  0.025776  0.031555
2017-12-29 -0.029498 -0.010570  0.007265 -0.004215

In [152]:
returns['贵州茅台'].corr(returns['老白干酒']) #返回相关系数

0.4391473278709468

In [153]:
returns['贵州茅台'].corr(returns['青岛啤酒'])

0.46778265694771254

In [154]:
returns.corr() #相关系数

          贵州茅台      青岛啤酒      重庆啤酒      老白干酒
贵州茅台  1.000000  0.467783  0.363876  0.439147
青岛啤酒  0.467783  1.000000  0.594449  0.457022
重庆啤酒  0.363876  0.594449  1.000000  0.500211
老白干酒  0.439147  0.457022  0.500211  1.000000

In [155]:
returns.cov() #协方差矩阵

          贵州茅台      青岛啤酒      重庆啤酒      老白干酒
贵州茅台  0.000395  0.000195  0.000213  0.000273
青岛啤酒  0.000195  0.000438  0.000366  0.000300
重庆啤酒  0.000213  0.000366  0.000866  0.000462
老白干酒  0.000273  0.000300  0.000462  0.000983

In [156]:
returns.corrwith(returns['贵州茅台'])

贵州茅台    1.000000
青岛啤酒    0.467783
重庆啤酒    0.363876
老白干酒    0.439147
dtype: float64

In [157]:
returns.corrwith(volume)

贵州茅台    0.141268
青岛啤酒    0.178257
重庆啤酒    0.111590
老白干酒    0.085180
dtype: float64

### 唯一值、值计数以及成员资格

In [158]:
obj = Series(list('cadaabbcc'))
uniques = obj.unique() # 返回唯一值数组
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [159]:
obj.value_counts() # 值计数

a    3
c    3
b    2
d    1
dtype: int64

In [160]:
# 还有一个顶级数组
pd.value_counts(obj.values,sort=False)

d    1
b    2
c    3
a    3
dtype: int64

In [161]:
mask = obj.isin(['b','c']) #成员资格
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [162]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [163]:
data = DataFrame({'Qu1':[1,2,3,4,5],'Qu2':[2,3,1,2,3],'Qu3':[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    2    3    5
2    3    1    2
3    4    2    4
4    5    3    4

In [164]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1    1  1.0  1.0
2    1  2.0  1.0
3    1  2.0  0.0
4    1  0.0  2.0
5    1  0.0  1.0

## 处理缺失数据

In [165]:
# pandas中使用浮点值NaN表示缺失数据
string_data = Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [166]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [167]:
# Python内置的None值也会被当做NA处理
string_data[0] = None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [168]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

<img src='pic\NA处理方法.png' width = 400>

### 滤除缺失数据

In [169]:
from numpy import nan as NA
data = Series([1,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [170]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [171]:
# 也可以通过布尔型索引达到这个目的
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [172]:
# 对于DataFrame对象，如何滤除缺失数据
# drop默认丢弃任何含有缺失值的行
data = DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [173]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [174]:
# 传入how = ‘all’则只丢弃全为NA的那些行
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [175]:
data[4] = NA

In [176]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [177]:
# 传入axis=1 ，可过滤列
data.dropna(axis = 1,how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [178]:
# 只想留下一部分观测数据
df = DataFrame(np.random.randn(7,3))
df

          0         1         2
0  1.233481 -1.083018  0.808235
1  2.210108 -0.948970  0.619523
2  0.542809  1.300216  0.605645
3 -0.816232 -0.793660 -1.250792
4  1.312657 -0.828448  0.432356
5  0.110019  0.030344  0.429366
6  0.109461  0.321966  1.350405

In [179]:
df.iloc[:4,1] = NA

In [180]:
df

          0         1         2
0  1.233481       NaN  0.808235
1  2.210108       NaN  0.619523
2  0.542809       NaN  0.605645
3 -0.816232       NaN -1.250792
4  1.312657 -0.828448  0.432356
5  0.110019  0.030344  0.429366
6  0.109461  0.321966  1.350405

In [181]:
df.iloc[:2,2] = NA
df

          0         1         2
0  1.233481       NaN       NaN
1  2.210108       NaN       NaN
2  0.542809       NaN  0.605645
3 -0.816232       NaN -1.250792
4  1.312657 -0.828448  0.432356
5  0.110019  0.030344  0.429366
6  0.109461  0.321966  1.350405

In [182]:
df.dropna(thresh = 3) # 当某行数据非缺失列数超过指定数值时才保留；

          0         1         2
4  1.312657 -0.828448  0.432356
5  0.110019  0.030344  0.429366
6  0.109461  0.321966  1.350405

### 填充缺失数据

In [183]:
df.fillna(0) # fillna默认返回新对象

          0         1         2
0  1.233481  0.000000  0.000000
1  2.210108  0.000000  0.000000
2  0.542809  0.000000  0.605645
3 -0.816232  0.000000 -1.250792
4  1.312657 -0.828448  0.432356
5  0.110019  0.030344  0.429366
6  0.109461  0.321966  1.350405

In [184]:
# 实现对“不同列”填充不同的值
df.fillna({1:0.5,2:-1})

          0         1         2
0  1.233481  0.500000 -1.000000
1  2.210108  0.500000 -1.000000
2  0.542809  0.500000  0.605645
3 -0.816232  0.500000 -1.250792
4  1.312657 -0.828448  0.432356
5  0.110019  0.030344  0.429366
6  0.109461  0.321966  1.350405

In [185]:
_ = df.fillna(0,inplace = True) # fillna默认返回新对象，设置inplace可以就地修改
df

          0         1         2
0  1.233481  0.000000  0.000000
1  2.210108  0.000000  0.000000
2  0.542809  0.000000  0.605645
3 -0.816232  0.000000 -1.250792
4  1.312657 -0.828448  0.432356
5  0.110019  0.030344  0.429366
6  0.109461  0.321966  1.350405

In [186]:
# 对于reindex有效的插值方法也可以用于fillna
df = DataFrame(np.random.randn(6,3))
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0 -1.435039  0.580791 -1.523173
1 -0.331070  0.055679 -0.549452
2  1.274967       NaN -1.779648
3  0.026688       NaN  0.062982
4  0.981539       NaN       NaN
5  0.137264       NaN       NaN

In [187]:
df.fillna(method = 'ffill')

          0         1         2
0 -1.435039  0.580791 -1.523173
1 -0.331070  0.055679 -0.549452
2  1.274967  0.055679 -1.779648
3  0.026688  0.055679  0.062982
4  0.981539  0.055679  0.062982
5  0.137264  0.055679  0.062982

In [188]:
df.fillna(method = 'ffill',limit = 2)

          0         1         2
0 -1.435039  0.580791 -1.523173
1 -0.331070  0.055679 -0.549452
2  1.274967  0.055679 -1.779648
3  0.026688  0.055679  0.062982
4  0.981539       NaN  0.062982
5  0.137264       NaN  0.062982

In [189]:
# 可以实现更多功能
data = Series([1. , NA , 3.5 , NA , 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

<img src = 'pic\fillna函数的参数.png' width = 400>

## 层次化索引

In [190]:
# 在一个轴上有多个索引级别
data = Series(np.random.randn(10),index = [list('aaabbbccdd'),[1,2,3,1,2,3,1,2,1,2]])
data

a  1   -0.167723
   2    0.334148
   3    1.047860
b  1    0.296957
   2   -0.140104
   3   -0.862715
c  1   -1.816383
   2    0.857570
d  1   -0.184423
   2    0.432977
dtype: float64

In [191]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 0, 1]])

In [192]:
data['b']

1    0.296957
2   -0.140104
3   -0.862715
dtype: float64

In [193]:
data['b':'c']

b  1    0.296957
   2   -0.140104
   3   -0.862715
c  1   -1.816383
   2    0.857570
dtype: float64

In [194]:
data[['b','d']]

b  1    0.296957
   2   -0.140104
   3   -0.862715
d  1   -0.184423
   2    0.432977
dtype: float64

In [195]:
# 在内层中取值
data[:,2]

a    0.334148
b   -0.140104
c    0.857570
d    0.432977
dtype: float64

In [196]:
# 通过unstack方法被重新安排到一个DataFrame中：
data.unstack()

          1         2         3
a -0.167723  0.334148  1.047860
b  0.296957 -0.140104 -0.862715
c -1.816383  0.857570       NaN
d -0.184423  0.432977       NaN

In [197]:
# unstack的逆算法是：stack
data.unstack().stack()

a  1   -0.167723
   2    0.334148
   3    1.047860
b  1    0.296957
   2   -0.140104
   3   -0.862715
c  1   -1.816383
   2    0.857570
d  1   -0.184423
   2    0.432977
dtype: float64

In [198]:
# 对于DataFrame,每条轴都可以有分层索引：
frame = DataFrame(np.arange(12).reshape((4,3)),
                  index = [['a','a','b','b'],[1,2,1,2]],
                  columns = [['Ohio','Ohio','Colorado'],['Green','Red','Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [199]:
# 各层都可以有名字
frame.index.names = ['key1','key2']
frame.columns.names = ['state','color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [200]:
# 可以轻松的选取列分组
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [201]:
# 可以单独的创建MultiIndex然后复用
pd.MultiIndex.from_arrays([['Ohio','Ohio','Colorado'],['Green','Red','Green']],names = ['state','color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

### 重排分级顺序

In [202]:
# swaplevel接受两个级别编号或名称，并返回一个互换了级别的新对象
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [203]:
frame.sort_index(level = 1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [204]:
frame.swaplevel(0,1).sort_index(level = 0) #由外向内排序即sort_index(level = 0)则性能好很多

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### 根据级别汇总统计

In [205]:
frame.sum()

state     color
Ohio      Green    18
          Red      22
Colorado  Green    26
dtype: int64

In [206]:
frame.sum(level = 'key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [207]:
frame.sum(level = 'color',axis = 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [208]:
# 上述其实是利用了groupby功能，后面会介绍

### 使用DataFrame的列

In [209]:
# 将DataFrame的一个或多个列当做行索引
frame = DataFrame({'a':range(7),
                   'b':range(7,0,-1),
                   'c':['one','one','one','two','two','two','two'],
                   'd':[0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [210]:
# set_index 会将一个或多个列转换成行索引（创建一个新DataFrame）
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [211]:
# 默认情况下，这些列都会移除，但也可以将其保留下来
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [212]:
# reset_index 功能与 set_index 相反
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## 其他有关pandas的话题

### 面板数据

In [213]:
# pandas有一个Panel数据结构，类似一个三维板的DataFrame。因为不常用，暂不介绍